app/controllers/blog_posts_controller.rb

  def index
    @blog_posts = BlogPost.all
---
SELECT "blog_posts".* FROM "blog_posts"

  def create
    @blog_post = BlogPost.new(blog_post_params)
    if @blog_post.save
---
INSERT INTO "blog_posts" ("title", "body", "created_at", "updated_at") VALUES ('2nd', 'asdatweq f', '2025-02-27 11:16:46.364341', '2025-02-27 11:16:46.364341') RETURNING "id"

  def set_blog_post
    @blog_post = BlogPost.find(params[:id])
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = NULL LIMIT 1